# Pandas
* open-source python data analysis library
* widely used for ML analysis (along with scikit-learn)
* **Series** & **DataFrame** objects are most widly used

In [ ]:
import pandas as pd

># 1. Series - generating Series
* ndarray + index

### generating pd series
* default: 0-based index

In [85]:
s1 = pd.Series(list(range(1, 6)))
print(s1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

### index & values

In [86]:
s2.index, s2.values

(RangeIndex(start=0, stop=5, step=1), array([1, 2, 3, 4, 5]))

### customized index
* compatible with 0-based index (not when indices are customized with numbers)
* index 중복 가능 / 하지만 지양할 것
* chr : ASCII code $\rightarrow$ character
* ord : character $\rightarrow$ ASCII code

In [109]:
s3 = pd.Series(list(range(1, 4)), index = [chr(i) for i in range(97, 100)])
print(s3)

a    1
b    2
c    3
dtype: int64

In [111]:
print(s3['a'], s3[0], s3['a'] is s3[0])
print("Questoin: why is it false?")

1 1 False
Questoin: why is it false?

### re-use index
* index of a series can be re-used through .index attribute

In [101]:
s4 = pd.Series(2, index = s3.index)
print(s4)

a    2
b    2
c    2
dtype: int64

### create series with dict

In [104]:
s5 = pd.Series({'a' : 1, 'b' : 2, 'c' : 3, 'd' : 4})
print(s5)

a    1
b    2
c    3
d    4
dtype: int64

># 2. Series - operations on Series

### basic attributes & operations

In [114]:
s = pd.Series([0, 1, 1, 2, 3, np.nan])
print(len(s))
print(s.size)
print(s.shape)
print(s.count()) # ignore NaN
print(s.unique()) # return ndarray with unique values
print(s.value_counts()) # ignore NaN / return pd series
type(s.value_counts())

6
6
(6,)
5
[  0.   1.   2.   3.  nan]
1.0    2
3.0    1
2.0    1
0.0    1
dtype: int64

pandas.core.series.Series

### head, tail, take
* head : print first n elements (default = 5)
* tail : print last n elements (default = 5)
* take : return elements matching given index list (only 0-based indexing allowed)

In [118]:
s = pd.Series(range(1,11))
print(s.take([0, 4, 3]))

0    1
4    5
3    4
dtype: int64

### single & multiple value accessing
* single: use index
  * default: 0-based index
  * `loc[]` : use index (인덱스 없는 경우 NaN)
  * `iloc[]` : use 0-based index (인덱스 없는 경우 error)
* multiple: use **list** of index

In [124]:
s = pd.Series([0, 1, 1, 2, 3, 4], index = ['a','b','c','d','e','f'])
print(s[0])
print(s.loc['a'])
print(s.iloc[0])
print(s[[4, 3, 2]])

0
0
0
e    3
d    2
c    1
dtype: int64

### summation
* summation is done over index
* non-matching index $\rightarrow$ NaN

In [23]:
s1 = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'e'])
s2 = pd.Series([4, 3, 2, 1], index=['d', 'c', 'b', 'a'])
print(s1 + s2)

a    2.0
b    4.0
c    6.0
d    NaN
e    NaN
dtype: float64

### numerical operations
* series & scalar: element-wise
* series & series: index-wise / non-matching index $\rightarrow$ NaN

In [24]:
s1 = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
exp = pd.Series(2, s1.index)
s1 ** exp

a     1
b     4
c     9
d    16
dtype: int64

### NaN
* default: ignore
* skipna=False $\rightarrow$ NaN not ignored

In [26]:
# Series는 NaN을 무시하고 연산
s = pd.Series([1, 2, 3, 4, np.NaN])
print(s.mean())
print(s.mean(skipna=False))

2.5
nan

### Boolean selection
* similar to ndarray boolean selection
* returns pd series

In [127]:
s = pd.Series(np.arange(1, 10))
s[s > 5]
s[(s % 2 == 0) & (s % 3 == 0)] # and
s[(s % 2 == 0) | (s % 3 == 0)] # or
s[s.index > 5]                 # condition for index

6    7
7    8
8    9
dtype: int64

In [33]:
print(s[s >= 7].sum()) # sum() is operated on series
print((s >= 7).sum())  # sum() is operated on Boolean list (True = 1, False = 0)

24
3

### updating series

In [ ]:
s = pd.Series([1, 10, 100], index = ['a', 'b', 'c'])
s['d'] = 1000  # add value
s['d'] = 10000 # update value

### slicing

In [128]:
s = pd.Series(np.arange(100, 110), index=np.arange(10, 20))
s[0:5]
s[:5]
s[5:]
s[-3:]

17    107
18    108
19    109
dtype: int64

># 3. DataFrame - generating DataFrame
* 2-dimensional object / analogous to spreadsheet
* index: row index + column index
* widely used in Data Analysis & ML $\rightarrow$ data: row / feature: column

### generating DataFrame

In [139]:
df1 = pd.DataFrame(np.array([[10, 11], [20, 22]]))

# stacking rows
df2 = pd.DataFrame([pd.Series(np.arange(10, 15)), pd.Series(np.arange(20, 25)), pd.Series(np.arange(20, 25))])

# stacking columns
s1 = pd.Series(np.arange(1, 6, 1))
s2 = pd.Series(np.arange(6, 11, 1))
df3 = pd.DataFrame({'c1': s1, 'c2': s2})

# customizing index & columns
df4 = pd.DataFrame(np.array([[22, 180], [23, 170]]), columns = ['Age', 'Height'], index = ['John', 'Bob'])

print(df1, df1.shape, df2, df2.shape, df3, df3.shape, df4, df4.shape, sep="\n")

    0   1
0  10  11
1  20  22
(2, 2)
    0   1   2   3   4
0  10  11  12  13  14
1  20  21  22  23  24
2  20  21  22  23  24
(3, 5)
   c1  c2
0   1   6
1   2   7
2   3   8
3   4   9
4   5  10
(5, 2)
      Age  Height
John   22     180
Bob    23     170
(2, 2)

### csv $\rightarrow$ dataframe
* most commonly used method to generate dataframe

In [148]:
sample_file = 'data/sample.csv'
sample_df = pd.read_csv(sample_file)
sample_df = pd.read_csv(sample_file, usecols = [0, 1, 2, 3, 7]) 
sample_df = pd.read_csv(sample_file, index_col = 'Symbol', usecols = [0, 1, 2, 3, 7]) 
sample_df = pd.read_csv(sample_file, index_col = 'Symbol', usecols=['Name', 'Symbol', 'Price'])
sample_df.head()

                       Name   Price
Symbol
MMM              3M Company  177.12
ABT     Abbott Laboratories   41.89
ABBV                 AbbVie   64.16
ACN           Accenture plc  115.11
ATVI    Activision Blizzard   41.29

In [150]:
apple_df = pd.read_csv('data/apple.csv', header = None) # no header
apple_df.head()

           0       1       2       3       4         5
0       Date    Open    High     Low   Close    Volume
1  30-Sep-16  112.46  113.37  111.80  113.05  36379106
2  29-Sep-16  113.16  113.80  111.80  112.18  35886990
3  28-Sep-16  113.69  114.64  113.43  113.95  29641085
4  27-Sep-16  113.00  113.18  112.34  113.09  24607412

### indexing & slicing
* indexing: column
* slicing: row (**.loc** & **.iloc** can be used)

In [160]:
apple_df = pd.read_csv('data/apple.csv')
apple_df.head()
apple_df['Date'] #return Series
apple_df[['Date']] #return DataFrame
apple_df[['Date', 'Close']] #return DataFrame

apple_df[4:9]

        Date    Open    High     Low   Close    Volume
4  26-Sep-16  111.64  113.39  111.55  112.88  29869442
5  23-Sep-16  114.42  114.79  111.55  112.71  52481151
6  22-Sep-16  114.35  114.94  114.00  114.62  31073984
7  21-Sep-16  113.85  113.99  112.44  113.55  36003185
8  20-Sep-16  113.05  114.12  112.51  113.57  34514269

### head(), tail(), describe(), info()
* head(): show first $n$ elements (default = 5)
* tail(): show last $n$ elements (default = 5)
* describe() & info(): provide information about DF

In [136]:
df1.describe()

               0          1
count   2.000000   2.000000
mean   15.000000  16.500000
std     7.071068   7.778175
min    10.000000  11.000000
25%    12.500000  13.750000
50%    15.000000  16.500000
75%    17.500000  19.250000
max    20.000000  22.000000

In [137]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
0    2 non-null int64
1    2 non-null int64
dtypes: int64(2)
memory usage: 112.0 bytes

### boolean selection

In [174]:
apple_df[(apple_df['High'] < 115) & (apple_df['Low'] >112)]
apple_df[(apple_df['High'] < 115) & (apple_df['Low'] >112)][['High','Low']]

     High     Low
2  114.64  113.43
3  113.18  112.34
6  114.94  114.00
7  113.99  112.44
8  114.12  112.51

### add/delete column

In [184]:
copy = apple_df.copy()
copy['Average'] = (copy['High'] + copy['Low'])/2 # add new column
copy.insert(1, 'Open*2', apple_df['Open'] * 2) #add new column in designated index
del copy['Open*2']
copy.head()

        Date    Open    High     Low   Close    Volume  Average
0  30-Sep-16  112.46  113.37  111.80  113.05  36379106  112.585
1  29-Sep-16  113.16  113.80  111.80  112.18  35886990  112.800
2  28-Sep-16  113.69  114.64  113.43  113.95  29641085  114.035
3  27-Sep-16  113.00  113.18  112.34  113.09  24607412  112.760
4  26-Sep-16  111.64  113.39  111.55  112.88  29869442  112.470

### add/delete row

In [185]:
df1 = copy[-3:]
copy = copy.append(df1) #add row
copy = copy.drop([20]) #delete row
copy.tail()

        Date    Open    High     Low   Close    Volume  Average
17  7-Sep-16  107.83  108.76  107.07  108.36  42364328  107.915
18  6-Sep-16  107.90  108.30  107.51  107.70  26880391  107.905
19  2-Sep-16  107.70  108.00  106.82  107.73  26334858  107.410
18  6-Sep-16  107.90  108.30  107.51  107.70  26880391  107.905
19  2-Sep-16  107.70  108.00  106.82  107.73  26334858  107.410

># 4. DataFrame - operations on DataFrame

># 4.1. group by

### group by

In [251]:
df = pd.read_csv('./data/euro_winners.csv')
df.head()

,Season,Nation,Winners,Score,Runners-up,Runner-UpNation,Venue,Attendance
0,1955–56,Spain,Real Madrid,4–3,Stade de Reims,France,"Parc des Princes,Paris",38239
1,1956–57,Spain,Real Madrid,2–0,Fiorentina,Italy,"Santiago Bernabéu Stadium, Madrid",124000
2,1957–58,Spain,Real Madrid,3–2,Milan,Italy,"Heysel Stadium,Brussels",67000
3,1958–59,Spain,Real Madrid,2–0,Stade de Reims,France,"Neckarstadion,Stuttgart",72000
4,1959–60,Spain,Real Madrid,7–3,Eintracht Frankfurt,Germany,"Hampden Park,Glasgow",127621

### .groups

In [244]:
nation_group = df.groupby('Nation')
nation_group.groups

{'England': Int64Index([12, 21, 22, 23, 24, 25, 26, 28, 43, 49, 52, 56], dtype='int64'),
 'France': Int64Index([37], dtype='int64'),
 'Germany': Int64Index([18, 19, 20, 27, 41, 45, 57], dtype='int64'),
 'Italy': Int64Index([7, 8, 9, 13, 29, 33, 34, 38, 40, 47, 51, 54], dtype='int64'),
 'Netherlands': Int64Index([14, 15, 16, 17, 32, 39], dtype='int64'),
 'Portugal': Int64Index([5, 6, 31, 48], dtype='int64'),
 'Romania': Int64Index([30], dtype='int64'),
 'Scotland': Int64Index([11], dtype='int64'),
 'Spain': Int64Index([0, 1, 2, 3, 4, 10, 36, 42, 44, 46, 50, 53, 55], dtype='int64'),
 'Yugoslavia': Int64Index([35], dtype='int64')}

In [245]:
len(nation_group.groups) # no. of groups

10

### .count()

In [246]:
nation_group.count()

,Season,Winners,Score,Runners-up,Runner-UpNation,Venue,Attendance
Nation,,,,,,,
England,12,12,12,12,12,12,12
France,1,1,1,1,1,1,1
Germany,7,7,7,7,7,7,7
Italy,12,12,12,12,12,12,12
Netherlands,6,6,6,6,6,6,6
Portugal,4,4,4,4,4,4,4
Romania,1,1,1,1,1,1,1
Scotland,1,1,1,1,1,1,1
Spain,13,13,13,13,13,13,13
Yugoslavia,1,1,1,1,1,1,1

### .size()

In [247]:
nation_group.size()

Nation
England        12
France          1
Germany         7
Italy          12
Netherlands     6
Portugal        4
Romania         1
Scotland        1
Spain          13
Yugoslavia      1
dtype: int64

### .size().sort_values(ascending = False)

In [248]:
nation_group.size().sort_values(ascending = False)

Nation
Spain          13
Italy          12
England        12
Germany         7
Netherlands     6
Portugal        4
Yugoslavia      1
Scotland        1
Romania         1
France          1
dtype: int64

### multiple column grouping

In [249]:
club_group = df.groupby(['Nation', 'Winners'])
club_group.size().sort_values(ascending = False)

Nation       Winners
Spain        Real Madrid          9
Italy        Milan                7
Germany      Bayern Munich        5
England      Liverpool            5
Spain        Barcelona            4
Netherlands  Ajax                 4
England      Manchester United    3
Italy        Internazionale       3
             Juventus             2
Portugal     Porto                2
             Benfica              2
England      Nottingham Forest    2
             Chelsea              1
France       Marseille            1
Yugoslavia   Red Star Belgrade    1
Germany      Borussia Dortmund    1
             Hamburg              1
Netherlands  Feyenoord            1
             PSV Eindhoven        1
Romania      Steaua Bucure?ti     1
Scotland     Celtic               1
England      Aston Villa          1
dtype: int64

># 4.2. change index

### .set_index(keys, inplace)

In [252]:
#df.set_index('Winners', inplace=True) # inplace=True -> change the original 
df.set_index(['Winners', 'Runners-up'], inplace=True) # multiple index allowed
df.head()

                                  Season Nation Score Runner-UpNation  \
Winners     Runners-up
Real Madrid Stade de Reims       1955–56  Spain   4–3          France
            Fiorentina           1956–57  Spain   2–0           Italy
            Milan                1957–58  Spain   3–2           Italy
            Stade de Reims       1958–59  Spain   2–0          France
            Eintracht Frankfurt  1959–60  Spain   7–3         Germany

                                                             Venue  Attendance
Winners     Runners-up
Real Madrid Stade de Reims                  Parc des Princes,Paris       38239
            Fiorentina           Santiago Bernabéu Stadium, Madrid      124000
            Milan                          Heysel Stadium,Brussels       67000
            Stade de Reims                 Neckarstadion,Stuttgart       72000
            Eintracht Frankfurt               Hampden Park,Glasgow      127621

### multiple index - data selection

In [255]:
df.loc['Real Madrid']
df.loc['Real Madrid'].loc['Milan']
df.loc['Real Madrid', 'Milan']

/home/dockeruser/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:3: PerformanceWarning: indexing past lexsort depth may impact performance.
  This is separate from the ipykernel package so we can avoid doing imports until

,,Season,Nation,Score,Runner-UpNation,Venue,Attendance
Winners,Runners-up,,,,,,
Real Madrid,Milan,1957–58,Spain,3–2,Italy,"Heysel Stadium,Brussels",67000

### .reset_index()

In [222]:
df = df.reset_index()
df.head()

,Winners,Runners-up,Season,Nation,Score,Runner-UpNation,Venue,Attendance
0,Real Madrid,Stade de Reims,1955–56,Spain,4–3,France,"Parc des Princes,Paris",38239
1,Real Madrid,Fiorentina,1956–57,Spain,2–0,Italy,"Santiago Bernabéu Stadium, Madrid",124000
2,Real Madrid,Milan,1957–58,Spain,3–2,Italy,"Heysel Stadium,Brussels",67000
3,Real Madrid,Stade de Reims,1958–59,Spain,2–0,France,"Neckarstadion,Stuttgart",72000
4,Real Madrid,Eintracht Frankfurt,1959–60,Spain,7–3,Germany,"Hampden Park,Glasgow",127621

># 4.3. group by - continued

In [230]:
df = pd.read_csv('./data/goal_stats_euro_leagues_2012-13.csv')
df.head()

        Month           Stat   EPL  La Liga  Serie A  Bundesliga
0  08/01/2012  MatchesPlayed  20.0       20     10.0        10.0
1  09/01/2012  MatchesPlayed  38.0       39     50.0        44.0
2  10/01/2012  MatchesPlayed  31.0       31     39.0        27.0
3  11/01/2012  MatchesPlayed  50.0       41     42.0        46.0
4  12/01/2012  MatchesPlayed  59.0       39     39.0        26.0

### group by with function

In [233]:
df1 = df.set_index('Month')
year_group = df1.groupby(lambda month : month.split('/')[2])
year_group.head()

                     Stat   EPL  La Liga  Serie A  Bundesliga
Month
08/01/2012  MatchesPlayed  20.0       20     10.0        10.0
09/01/2012  MatchesPlayed  38.0       39     50.0        44.0
10/01/2012  MatchesPlayed  31.0       31     39.0        27.0
11/01/2012  MatchesPlayed  50.0       41     42.0        46.0
12/01/2012  MatchesPlayed  59.0       39     39.0        26.0
01/01/2013  MatchesPlayed  42.0       40     40.0        18.0
02/01/2013  MatchesPlayed  30.0       40     40.0        36.0
03/01/2013  MatchesPlayed  35.0       38     39.0        36.0
04/01/2013  MatchesPlayed  42.0       42     41.0        36.0
05/01/2013  MatchesPlayed  33.0       40     40.0        27.0

### mutiple index $\rightarrow$ grouping with level

In [241]:
df2 = df.set_index(['Month','Stat'])
year_group2 = df2.groupby(level = 1)
year_group3 = df2.groupby(level = 'Stat') # same
year_group2.head()
year_group3.head()

                            EPL  La Liga  Serie A  Bundesliga
Month      Stat
08/01/2012 MatchesPlayed   20.0       20     10.0        10.0
09/01/2012 MatchesPlayed   38.0       39     50.0        44.0
10/01/2012 MatchesPlayed   31.0       31     39.0        27.0
11/01/2012 MatchesPlayed   50.0       41     42.0        46.0
12/01/2012 MatchesPlayed   59.0       39     39.0        26.0
08/01/2012 GoalsScored     57.0       60     21.0        23.0
09/01/2012 GoalsScored    111.0      112    133.0       135.0
10/01/2012 GoalsScored     95.0       88     97.0        77.0
11/01/2012 GoalsScored    121.0      116    120.0       137.0
12/01/2012 GoalsScored    183.0      109    125.0        72.0

In [265]:
# multi level grouping
month_stat_group = df2.groupby(level = [0, 1])
stat_group = df2.groupby(level = 1)

for name, group in month_stat_group:
    print(name) # tuple of indices
    print(group) # data

('01/01/2013', 'GoalsScored')
                          EPL  La Liga  Serie A  Bundesliga
Month      Stat
01/01/2013 GoalsScored  117.0      121    104.0        51.0
('01/01/2013', 'MatchesPlayed')
                           EPL  La Liga  Serie A  Bundesliga
Month      Stat
01/01/2013 MatchesPlayed  42.0       40     40.0        18.0
('02/01/2013', 'GoalsScored')
                         EPL  La Liga  Serie A  Bundesliga
Month      Stat
02/01/2013 GoalsScored  87.0      110    100.0       101.0
('02/01/2013', 'MatchesPlayed')
                           EPL  La Liga  Serie A  Bundesliga
Month      Stat
02/01/2013 MatchesPlayed  30.0       40     40.0        36.0
('03/01/2013', 'GoalsScored')
                         EPL  La Liga  Serie A  Bundesliga
Month      Stat
03/01/2013 GoalsScored  91.0      101     99.0       106.0
('03/01/2013', 'MatchesPlayed')
                           EPL  La Liga  Serie A  Bundesliga
Month      Stat
03/01/2013 MatchesPlayed  35.0       38     39.0        36.0
('04/01/2013', 'GoalsScored')
                          EPL  La Liga  Serie A  Bundesliga
Month      Stat
04/01/2013 GoalsScored  105.0      127    102.0       104.0
('04/01/2013', 'MatchesPlayed')
                           EPL  La Liga  Serie A  Bundesliga
Month      Stat
04/01/2013 MatchesPlayed  42.0       42     41.0        36.0
('05/01/2013', 'GoalsScored')
                         EPL  La Liga  Serie A  Bundesliga
Month      Stat
05/01/2013 GoalsScored  96.0      109    102.0        92.0
('05/01/2013', 'MatchesPlayed')
                           EPL  La Liga  Serie A  Bundesliga
Month      Stat
05/01/2013 MatchesPlayed  33.0       40     40.0        27.0
('06/01/2013', 'GoalsScored')
                        EPL  La Liga  Serie A  Bundesliga
Month      Stat
06/01/2013 GoalsScored  NaN       80      NaN         NaN
('06/02/2013', 'MatchesPlayed')
                          EPL  La Liga  Serie A  Bundesliga
Month      Stat
06/02/2013 MatchesPlayed  NaN       10      NaN         NaN
('08/01/2012', 'GoalsScored')
                         EPL  La Liga  Serie A  Bundesliga
Month      Stat
08/01/2012 GoalsScored  57.0       60     21.0        23.0
('08/01/2012', 'MatchesPlayed')
                           EPL  La Liga  Serie A  Bundesliga
Month      Stat
08/01/2012 MatchesPlayed  20.0       20     10.0        10.0
('09/01/2012', 'GoalsScored')
                          EPL  La Liga  Serie A  Bundesliga
Month      Stat
09/01/2012 GoalsScored  111.0      112    133.0       135.0
('09/01/2012', 'MatchesPlayed')
                           EPL  La Liga  Serie A  Bundesliga
Month      Stat
09/01/2012 MatchesPlayed  38.0       39     50.0        44.0
('10/01/2012', 'GoalsScored')
                         EPL  La Liga  Serie A  Bundesliga
Month      Stat
10/01/2012 GoalsScored  95.0       88     97.0        77.0
('10/01/2012', 'MatchesPlayed')
                           EPL  La Liga  Serie A  Bundesliga
Month      Stat
10/01/2012 MatchesPlayed  31.0       31     39.0        27.0
('11/01/2012', 'GoalsScored')
                          EPL  La Liga  Serie A  Bundesliga
Month      Stat
11/01/2012 GoalsScored  121.0      116    120.0       137.0
('11/01/2012', 'MatchesPlayed')
                           EPL  La Liga  Serie A  Bundesliga
Month      Stat
11/01/2012 MatchesPlayed  50.0       41     42.0        46.0
('12/01/2012', 'GoalsScored')
                          EPL  La Liga  Serie A  Bundesliga
Month      Stat
12/01/2012 GoalsScored  183.0      109    125.0        72.0
('12/01/2012', 'MatchesPlayed')
                           EPL  La Liga  Serie A  Bundesliga
Month      Stat
12/01/2012 MatchesPlayed  59.0       39     39.0        26.0

># 4.4 aggregation functions

### .sum()

In [293]:
stat_group.sum()
df_total = df2.sum(level = 'Stat') #same operation
df_total

                  EPL  La Liga  Serie A  Bundesliga
Stat
GoalsScored   1063.00     1133  1003.00      898.00
MatchesPlayed  380.00      380   380.00      306.00

### aggregate methods

In [306]:
stat_group.sum()
stat_group.aggregate(len)
stat_group.aggregate(np.sum) # same as stat_group.sum()
stat_group.aggregate([np.sum, np.mean, np.size])

                  EPL              La Liga             Serie A               \
                  sum   mean  size     sum   mean size     sum   mean  size
Stat
GoalsScored   1063.00 106.30 11.00    1133 103.00   11 1003.00 100.30 11.00
MatchesPlayed  380.00  38.00 11.00     380  34.55   11  380.00  38.00 11.00

              Bundesliga
                     sum  mean  size
Stat
GoalsScored       898.00 89.80 11.00
MatchesPlayed     306.00 30.60 11.00

### practice - calculating "goals / match"

In [294]:
goals_per_game_df = df_total.loc['GoalsScored'] / df_total.loc['MatchesPlayed']
goals_per_game_df = pd.DataFrame(goals_per_game_df).T.rename(index = {0: 'goals per game'})
goals_per_game_df

                EPL  La Liga  Serie A  Bundesliga
goals per game 2.80     2.98     2.64        2.93

In [295]:
df_total = df_total.append(goals_per_game_df)
pd.options.display.float_format='{:.2f}'.format

df_total

                   EPL  La Liga  Serie A  Bundesliga
GoalsScored    1063.00  1133.00  1003.00      898.00
MatchesPlayed   380.00   380.00   380.00      306.00
goals per game    2.80     2.98     2.64        2.93

># 4.5. transform
* group by $\rightarrow$ manipulation $\rightarrow$ merge

In [307]:
df = pd.read_excel("data/sales_transactions.xlsx")

In [315]:
df.head()

   account           name  order       sku  quantity  unit price  ext price
0   383080       Will LLC  10001  B1-20000         7       33.69     235.83
1   383080       Will LLC  10001  S1-27722        11       21.12     232.32
2   383080       Will LLC  10001  B1-86481         3       35.99     107.97
3   412290  Jerde-Hilpert  10005  S1-06532        48       55.82    2679.36
4   412290  Jerde-Hilpert  10005  S1-82801        21       13.62     286.02

In [311]:
df.groupby('order')["ext price"].sum()

order
10001    576.12
10005   8185.49
10006   3724.49
Name: ext price, dtype: float64

### now, let's add this information to the original DF

In [312]:
order_total = df.groupby('order')["ext price"].sum().rename("total").reset_index()
order_total

   order   total
0  10001  576.12
1  10005 8185.49
2  10006 3724.49

In [316]:
result = df.merge(order_total, on='order')
result["portion"] = result["ext price"] / result["total"]
result.head()

,account,name,order,sku,quantity,unit price,ext price,total,portion
0,383080,Will LLC,10001,B1-20000,7,33.69,235.83,576.12,0.41
1,383080,Will LLC,10001,S1-27722,11,21.12,232.32,576.12,0.40
2,383080,Will LLC,10001,B1-86481,3,35.99,107.97,576.12,0.19
3,412290,Jerde-Hilpert,10005,S1-06532,48,55.82,2679.36,8185.49,0.33
4,412290,Jerde-Hilpert,10005,S1-82801,21,13.62,286.02,8185.49,0.03

### same operation with "transform"

In [318]:
df['total'] = df.groupby('order')["ext price"].transform(np.sum)
df["portion"] = df["ext price"] / df["total"]
df.head()

,account,name,order,sku,quantity,unit price,ext price,total,portion
0,383080,Will LLC,10001,B1-20000,7,33.69,235.83,576.12,0.41
1,383080,Will LLC,10001,S1-27722,11,21.12,232.32,576.12,0.40
2,383080,Will LLC,10001,B1-86481,3,35.99,107.97,576.12,0.19
3,412290,Jerde-Hilpert,10005,S1-06532,48,55.82,2679.36,8185.49,0.33
4,412290,Jerde-Hilpert,10005,S1-82801,21,13.62,286.02,8185.49,0.03

># 4.6. pivot & pivot_table
* dataframe의 형태 변경 (index, column, data를 명시)

### original DF

In [322]:
plant_df = pd.read_csv('data/PlantGrowth.csv')
plant_df.head(10)

   observation  weight group
0            1    4.17  ctrl
1            2    5.58  ctrl
2            3    5.18  ctrl
3            4    6.11  ctrl
4            5    4.50  ctrl
5            6    4.61  ctrl
6            7    5.17  ctrl
7            8    4.53  ctrl
8            9    5.33  ctrl
9           10    5.14  ctrl

### DF reshaped with pivot

In [326]:
plant_df.pivot(index = 'observation', columns = 'group', values = 'weight')

group        ctrl  trt1  trt2
observation
1            4.17  4.81  6.31
2            5.58  4.17  5.12
3            5.18  4.41  5.54
4            6.11  3.59  5.50
5            4.50  5.87  5.37
6            4.61  3.83  5.29
7            5.17  6.03  4.92
8            4.53  4.89  6.15
9            5.33  4.32  5.80
10           5.14  4.69  5.26

### DF reshaped with pivot_table

In [323]:
pd.pivot_table(plant_df, values = 'weight', index = 'observation', columns='group')

group        ctrl  trt1  trt2
observation
1            4.17  4.81  6.31
2            5.58  4.17  5.12
3            5.18  4.41  5.54
4            6.11  3.59  5.50
5            4.50  5.87  5.37
6            4.61  3.83  5.29
7            5.17  6.03  4.92
8            4.53  4.89  6.15
9            5.33  4.32  5.80
10           5.14  4.69  5.26

In [324]:
pd.pivot_table(plant_df, values = 'weight', columns='group')

group   ctrl  trt1  trt2
weight  5.03  4.66  5.53

In [327]:
pd.pivot_table(plant_df, values = 'weight', columns='observation')

observation   1    2    3    4    5    6    7    8    9    10
weight      5.10 4.96 5.04 5.07 5.25 4.58 5.37 5.19 5.15 5.03

### pivot_table uses aggregate method when needed

In [338]:
table = OrderedDict((("Item", ['Item0', 'Item0', 'Item0', 'Item1']), ('CType',['Gold', 'Bronze', 'Gold', 'Silver']), ('US',  [1, 2, 3, 4])))
df = pd.DataFrame(table)
df

    Item   CType  US
0  Item0    Gold   1
1  Item0  Bronze   2
2  Item0    Gold   3
3  Item1  Silver   4

In [337]:
df.pivot_table(index='Item', columns='CType', values='US')
# "Item0 - Gold" has two values, 1 and 3
# pivot_table adds up those values

CType  Bronze  Gold  Silver
Item
Item0    2.00  2.00     nan
Item1     nan   nan    4.00